GopalSaraf/Practicals/PSDL/include/proc/pic18f8493.inc
// Register: LCDSE3
#define LCDSE3 LCDSE3
LCDSE3                                   equ 0F5Dh
// bitfield definitions
LCDSE3_LCDSE3_POSN                       equ 0000h
LCDSE3_LCDSE3_POSITION                   equ 0000h
LCDSE3_LCDSE3_SIZE                       equ 0008h
LCDSE3_LCDSE3_LENGTH                     equ 0008h
LCDSE3_LCDSE3_MASK                       equ 00FFh
LCDSE3_SE24_POSN                         equ 0000h
LCDSE3_SE24_POSITION                     equ 0000h
LCDSE3_SE24_SIZE                         equ 0001h
LCDSE3_SE24_LENGTH                       equ 0001h
LCDSE3_SE24_MASK                         equ 0001h
LCDSE3_SE25_POSN                         equ 0001h
LCDSE3_SE25_POSITION                     equ 0001h
LCDSE3_SE25_SIZE                         equ 0001h
LCDSE3_SE25_LENGTH                       equ 0001h
LCDSE3_SE25_MASK                         equ 0002h
LCDSE3_SE26_POSN                         equ 0002h
LCDSE3_SE26_POSITION                     equ 0002h
LCDSE3_SE26_SIZE                         equ 0001h
LCDSE3_SE26_LENGTH                       equ 0001h
LCDSE3_SE26_MASK                         equ 0004h
LCDSE3_SE27_POSN                         equ 0003h
LCDSE3_SE27_POSITION                     equ 0003h
LCDSE3_SE27_SIZE                         equ 0001h
LCDSE3_SE27_LENGTH                       equ 0001h
LCDSE3_SE27_MASK                         equ 0008h
LCDSE3_SE28_POSN                         equ 0004h
LCDSE3_SE28_POSITION                     equ 0004h
LCDSE3_SE28_SIZE                         equ 0001h
LCDSE3_SE28_LENGTH                       equ 0001h
LCDSE3_SE28_MASK                         equ 0010h
LCDSE3_SE29_POSN                         equ 0005h
LCDSE3_SE29_POSITION                     equ 0005h
LCDSE3_SE29_SIZE                         equ 0001h
LCDSE3_SE29_LENGTH                       equ 0001h
LCDSE3_SE29_MASK                         equ 0020h
LCDSE3_SE30_POSN                         equ 0006h
LCDSE3_SE30_POSITION                     equ 0006h
LCDSE3_SE30_SIZE                         equ 0001h
LCDSE3_SE30_LENGTH                       equ 0001h
LCDSE3_SE30_MASK                         equ 0040h
LCDSE3_SE31_POSN                         equ 0007h
LCDSE3_SE31_POSITION                     equ 0007h
LCDSE3_SE31_SIZE                         equ 0001h
LCDSE3_SE31_LENGTH                       equ 0001h
LCDSE3_SE31_MASK                         equ 0080h
LCDSE3_SEGEN24_POSN                      equ 0000h
LCDSE3_SEGEN24_POSITION                  equ 0000h
LCDSE3_SEGEN24_SIZE                      equ 0001h
LCDSE3_SEGEN24_LENGTH                    equ 0001h
LCDSE3_SEGEN24_MASK                      equ 0001h
LCDSE3_SEGEN25_POSN                      equ 0001h
LCDSE3_SEGEN25_POSITION                  equ 0001h
LCDSE3_SEGEN25_SIZE                      equ 0001h
LCDSE3_SEGEN25_LENGTH                    equ 0001h
LCDSE3_SEGEN25_MASK                      equ 0002h
LCDSE3_SEGEN26_POSN                      equ 0002h
LCDSE3_SEGEN26_POSITION                  equ 0002h
LCDSE3_SEGEN26_SIZE                      equ 0001h
LCDSE3_SEGEN26_LENGTH                    equ 0001h
LCDSE3_SEGEN26_MASK                      equ 0004h
LCDSE3_SEGEN27_POSN                      equ 0003h
LCDSE3_SEGEN27_POSITION                  equ 0003h
LCDSE3_SEGEN27_SIZE                      equ 0001h
LCDSE3_SEGEN27_LENGTH                    equ 0001h
LCDSE3_SEGEN27_MASK                      equ 0008h
LCDSE3_SEGEN28_POSN                      equ 0004h
LCDSE3_SEGEN28_POSITION                  equ 0004h
LCDSE3_SEGEN28_SIZE                      equ 0001h
LCDSE3_SEGEN28_LENGTH                    equ 0001h
LCDSE3_SEGEN28_MASK                      equ 0010h
LCDSE3_SEGEN29_POSN                      equ 0005h
LCDSE3_SEGEN29_POSITION                  equ 0005h
LCDSE3_SEGEN29_SIZE                      equ 0001h
LCDSE3_SEGEN29_LENGTH                    equ 0001h
LCDSE3_SEGEN29_MASK                      equ 0020h
LCDSE3_SEGEN30_POSN                      equ 0006h
LCDSE3_SEGEN30_POSITION                  equ 0006h
LCDSE3_SEGEN30_SIZE                      equ 0001h
LCDSE3_SEGEN30_LENGTH                    equ 0001h
LCDSE3_SEGEN30_MASK                      equ 0040h
LCDSE3_SEGEN31_POSN                      equ 0007h
LCDSE3_SEGEN31_POSITION                  equ 0007h
LCDSE3_SEGEN31_SIZE                      equ 0001h
LCDSE3_SEGEN31_LENGTH                    equ 0001h
LCDSE3_SEGEN31_MASK                      equ 0080h

// Register: LCDSE4
#define LCDSE4 LCDSE4
LCDSE4                                   equ 0F5Eh
// bitfield definitions
LCDSE4_LCDSE4_POSN                       equ 0000h
LCDSE4_LCDSE4_POSITION                   equ 0000h
LCDSE4_LCDSE4_SIZE                       equ 0008h
LCDSE4_LCDSE4_LENGTH                     equ 0008h
LCDSE4_LCDSE4_MASK                       equ 00FFh
LCDSE4_SE32_POSN                         equ 0000h
LCDSE4_SE32_POSITION                     equ 0000h
LCDSE4_SE32_SIZE                         equ 0001h
LCDSE4_SE32_LENGTH                       equ 0001h
LCDSE4_SE32_MASK                         equ 0001h
LCDSE4_SE33_POSN                         equ 0001h
LCDSE4_SE33_POSITION                     equ 0001h
LCDSE4_SE33_SIZE                         equ 0001h
LCDSE4_SE33_LENGTH                       equ 0001h
LCDSE4_SE33_MASK                         equ 0002h
LCDSE4_SE34_POSN                         equ 0002h
LCDSE4_SE34_POSITION                     equ 0002h
LCDSE4_SE34_SIZE                         equ 0001h
LCDSE4_SE34_LENGTH                       equ 0001h
LCDSE4_SE34_MASK                         equ 0004h
LCDSE4_SE35_POSN                         equ 0003h
LCDSE4_SE35_POSITION                     equ 0003h
LCDSE4_SE35_SIZE                         equ 0001h
LCDSE4_SE35_LENGTH                       equ 0001h
LCDSE4_SE35_MASK                         equ 0008h
LCDSE4_SE36_POSN                         equ 0004h
LCDSE4_SE36_POSITION                     equ 0004h
LCDSE4_SE36_SIZE                         equ 0001h
LCDSE4_SE36_LENGTH                       equ 0001h
LCDSE4_SE36_MASK                         equ 0010h
LCDSE4_SE37_POSN                         equ 0005h
LCDSE4_SE37_POSITION                     equ 0005h
LCDSE4_SE37_SIZE                         equ 0001h
LCDSE4_SE37_LENGTH                       equ 0001h
LCDSE4_SE37_MASK                         equ 0020h
LCDSE4_SE38_POSN                         equ 0006h
LCDSE4_SE38_POSITION                     equ 0006h
LCDSE4_SE38_SIZE                         equ 0001h
LCDSE4_SE38_LENGTH                       equ 0001h
LCDSE4_SE38_MASK                         equ 0040h
LCDSE4_SE39_POSN                         equ 0007h
LCDSE4_SE39_POSITION                     equ 0007h
LCDSE4_SE39_SIZE                         equ 0001h
LCDSE4_SE39_LENGTH                       equ 0001h
LCDSE4_SE39_MASK                         equ 0080h
LCDSE4_SEGEN32_POSN                      equ 0000h
LCDSE4_SEGEN32_POSITION                  equ 0000h
LCDSE4_SEGEN32_SIZE                      equ 0001h
LCDSE4_SEGEN32_LENGTH                    equ 0001h
LCDSE4_SEGEN32_MASK                      equ 0001h
LCDSE4_SEGEN33_POSN                      equ 0001h
LCDSE4_SEGEN33_POSITION                  equ 0001h
LCDSE4_SEGEN33_SIZE                      equ 0001h
LCDSE4_SEGEN33_LENGTH                    equ 0001h
LCDSE4_SEGEN33_MASK                      equ 0002h
LCDSE4_SEGEN34_POSN                      equ 0002h
LCDSE4_SEGEN34_POSITION                  equ 0002h
LCDSE4_SEGEN34_SIZE                      equ 0001h
LCDSE4_SEGEN34_LENGTH                    equ 0001h
LCDSE4_SEGEN34_MASK                      equ 0004h
LCDSE4_SEGEN35_POSN                      equ 0003h
LCDSE4_SEGEN35_POSITION                  equ 0003h
LCDSE4_SEGEN35_SIZE                      equ 0001h
LCDSE4_SEGEN35_LENGTH                    equ 0001h
LCDSE4_SEGEN35_MASK                      equ 0008h
LCDSE4_SEGEN36_POSN                      equ 0004h
LCDSE4_SEGEN36_POSITION                  equ 0004h
LCDSE4_SEGEN36_SIZE                      equ 0001h
LCDSE4_SEGEN36_LENGTH                    equ 0001h
LCDSE4_SEGEN36_MASK                      equ 0010h
LCDSE4_SEGEN37_POSN                      equ 0005h
LCDSE4_SEGEN37_POSITION                  equ 0005h
LCDSE4_SEGEN37_SIZE                      equ 0001h
LCDSE4_SEGEN37_LENGTH                    equ 0001h
LCDSE4_SEGEN37_MASK                      equ 0020h
LCDSE4_SEGEN38_POSN                      equ 0006h
LCDSE4_SEGEN38_POSITION                  equ 0006h
LCDSE4_SEGEN38_SIZE                      equ 0001h
LCDSE4_SEGEN38_LENGTH                    equ 0001h
LCDSE4_SEGEN38_MASK                      equ 0040h
LCDSE4_SEGEN39_POSN                      equ 0007h
LCDSE4_SEGEN39_POSITION                  equ 0007h
LCDSE4_SEGEN39_SIZE                      equ 0001h
LCDSE4_SEGEN39_LENGTH                    equ 0001h
LCDSE4_SEGEN39_MASK                      equ 0080h

// Register: LCDSE5
#define LCDSE5 LCDSE5
LCDSE5                                   equ 0F5Fh
// bitfield definitions
LCDSE5_LCDSE5_POSN                       equ 0000h
LCDSE5_LCDSE5_POSITION                   equ 0000h
LCDSE5_LCDSE5_SIZE                       equ 0008h
LCDSE5_LCDSE5_LENGTH                     equ 0008h
LCDSE5_LCDSE5_MASK                       equ 00FFh
LCDSE5_SE40_POSN                         equ 0000h
LCDSE5_SE40_POSITION                     equ 0000h
LCDSE5_SE40_SIZE                         equ 0001h
LCDSE5_SE40_LENGTH                       equ 0001h
LCDSE5_SE40_MASK                         equ 0001h
LCDSE5_SE41_POSN                         equ 0001h
LCDSE5_SE41_POSITION                     equ 0001h
LCDSE5_SE41_SIZE                         equ 0001h
LCDSE5_SE41_LENGTH                       equ 0001h
LCDSE5_SE41_MASK                         equ 0002h
LCDSE5_SE42_POSN                         equ 0002h
LCDSE5_SE42_POSITION                     equ 0002h
LCDSE5_SE42_SIZE                         equ 0001h
LCDSE5_SE42_LENGTH                       equ 0001h
LCDSE5_SE42_MASK                         equ 0004h
LCDSE5_SE43_POSN                         equ 0003h
LCDSE5_SE43_POSITION                     equ 0003h
LCDSE5_SE43_SIZE                         equ 0001h
LCDSE5_SE43_LENGTH                       equ 0001h
LCDSE5_SE43_MASK                         equ 0008h
LCDSE5_SE44_POSN                         equ 0004h
LCDSE5_SE44_POSITION                     equ 0004h
LCDSE5_SE44_SIZE                         equ 0001h
LCDSE5_SE44_LENGTH                       equ 0001h
LCDSE5_SE44_MASK                         equ 0010h
LCDSE5_SE45_POSN                         equ 0005h
LCDSE5_SE45_POSITION                     equ 0005h
LCDSE5_SE45_SIZE                         equ 0001h
LCDSE5_SE45_LENGTH                       equ 0001h
LCDSE5_SE45_MASK                         equ 0020h
LCDSE5_SE46_POSN                         equ 0006h
LCDSE5_SE46_POSITION                     equ 0006h
LCDSE5_SE46_SIZE                         equ 0001h
LCDSE5_SE46_LENGTH                       equ 0001h
LCDSE5_SE46_MASK                         equ 0040h
LCDSE5_SE47_POSN                         equ 0007h
LCDSE5_SE47_POSITION                     equ 0007h
LCDSE5_SE47_SIZE                         equ 0001h
LCDSE5_SE47_LENGTH                       equ 0001h
LCDSE5_SE47_MASK                         equ 0080h
LCDSE5_SEGEN40_POSN                      equ 0000h
LCDSE5_SEGEN40_POSITION                  equ 0000h
LCDSE5_SEGEN40_SIZE                      equ 0001h
LCDSE5_SEGEN40_LENGTH                    equ 0001h
LCDSE5_SEGEN40_MASK                      equ 0001h
LCDSE5_SEGEN41_POSN                      equ 0001h
LCDSE5_SEGEN41_POSITION                  equ 0001h
LCDSE5_SEGEN41_SIZE                      equ 0001h
LCDSE5_SEGEN41_LENGTH                    equ 0001h
LCDSE5_SEGEN41_MASK                      equ 0002h
LCDSE5_SEGEN42_POSN                      equ 0002h
LCDSE5_SEGEN42_POSITION                  equ 0002h
LCDSE5_SEGEN42_SIZE                      equ 0001h
LCDSE5_SEGEN42_LENGTH                    equ 0001h
LCDSE5_SEGEN42_MASK                      equ 0004h
LCDSE5_SEGEN43_POSN                      equ 0003h
LCDSE5_SEGEN43_POSITION                  equ 0003h
LCDSE5_SEGEN43_SIZE                      equ 0001h
LCDSE5_SEGEN43_LENGTH                    equ 0001h
LCDSE5_SEGEN43_MASK                      equ 0008h
LCDSE5_SEGEN44_POSN                      equ 0004h
LCDSE5_SEGEN44_POSITION                  equ 0004h
LCDSE5_SEGEN44_SIZE                      equ 0001h
LCDSE5_SEGEN44_LENGTH                    equ 0001h
LCDSE5_SEGEN44_MASK                      equ 0010h
LCDSE5_SEGEN45_POSN                      equ 0005h
LCDSE5_SEGEN45_POSITION                  equ 0005h
LCDSE5_SEGEN45_SIZE                      equ 0001h
LCDSE5_SEGEN45_LENGTH                    equ 0001h
LCDSE5_SEGEN45_MASK                      equ 0020h
LCDSE5_SEGEN46_POSN                      equ 0006h
LCDSE5_SEGEN46_POSITION                  equ 0006h
LCDSE5_SEGEN46_SIZE                      equ 0001h
LCDSE5_SEGEN46_LENGTH                    equ 0001h
LCDSE5_SEGEN46_MASK                      equ 0040h
LCDSE5_SEGEN47_POSN                      equ 0007h
LCDSE5_SEGEN47_POSITION                  equ 0007h
LCDSE5_SEGEN47_SIZE                      equ 0001h
LCDSE5_SEGEN47_LENGTH                    equ 0001h
LCDSE5_SEGEN47_MASK                      equ 0080h

// Register: LCDDATA0
#define LCDDATA0 LCDDATA0
LCDDATA0                                 equ 0F60h
// bitfield definitions
LCDDATA0_LCDDATA0_POSN                   equ 0000h
LCDDATA0_LCDDATA0_POSITION               equ 0000h
LCDDATA0_LCDDATA0_SIZE                   equ 0008h
LCDDATA0_LCDDATA0_LENGTH                 equ 0008h
LCDDATA0_LCDDATA0_MASK                   equ 00FFh
LCDDATA0_S0C0_POSN                       equ 0000h
LCDDATA0_S0C0_POSITION                   equ 0000h
LCDDATA0_S0C0_SIZE                       equ 0001h
LCDDATA0_S0C0_LENGTH                     equ 0001h
LCDDATA0_S0C0_MASK                       equ 0001h
LCDDATA0_S1C0_POSN                       equ 0001h
LCDDATA0_S1C0_POSITION                   equ 0001h
LCDDATA0_S1C0_SIZE                       equ 0001h
LCDDATA0_S1C0_LENGTH                     equ 0001h
LCDDATA0_S1C0_MASK                       equ 0002h
LCDDATA0_S2C0_POSN                       equ 0002h
LCDDATA0_S2C0_POSITION                   equ 0002h
LCDDATA0_S2C0_SIZE                       equ 0001h
LCDDATA0_S2C0_LENGTH                     equ 0001h
LCDDATA0_S2C0_MASK                       equ 0004h
LCDDATA0_S3C0_POSN                       equ 0003h
LCDDATA0_S3C0_POSITION                   equ 0003h
LCDDATA0_S3C0_SIZE                       equ 0001h
LCDDATA0_S3C0_LENGTH                     equ 0001h
LCDDATA0_S3C0_MASK                       equ 0008h
LCDDATA0_S4C0_POSN                       equ 0004h
LCDDATA0_S4C0_POSITION                   equ 0004h
LCDDATA0_S4C0_SIZE                       equ 0001h
LCDDATA0_S4C0_LENGTH                     equ 0001h
LCDDATA0_S4C0_MASK                       equ 0010h
LCDDATA0_S5C0_POSN                       equ 0005h
LCDDATA0_S5C0_POSITION                   equ 0005h
LCDDATA0_S5C0_SIZE                       equ 0001h
LCDDATA0_S5C0_LENGTH                     equ 0001h
LCDDATA0_S5C0_MASK                       equ 0020h
LCDDATA0_S6C0_POSN                       equ 0006h
LCDDATA0_S6C0_POSITION                   equ 0006h
LCDDATA0_S6C0_SIZE                       equ 0001h
LCDDATA0_S6C0_LENGTH                     equ 0001h
LCDDATA0_S6C0_MASK                       equ 0040h
LCDDATA0_S7C0_POSN                       equ 0007h
LCDDATA0_S7C0_POSITION                   equ 0007h
LCDDATA0_S7C0_SIZE                       equ 0001h
LCDDATA0_S7C0_LENGTH                     equ 0001h
LCDDATA0_S7C0_MASK                       equ 0080h
LCDDATA0_SEG0COM0_POSN                   equ 0000h
LCDDATA0_SEG0COM0_POSITION               equ 0000h
LCDDATA0_SEG0COM0_SIZE                   equ 0001h
LCDDATA0_SEG0COM0_LENGTH                 equ 0001h
LCDDATA0_SEG0COM0_MASK                   equ 0001h
LCDDATA0_SEG1COM0_POSN                   equ 0001h
LCDDATA0_SEG1COM0_POSITION               equ 0001h
LCDDATA0_SEG1COM0_SIZE                   equ 0001h
LCDDATA0_SEG1COM0_LENGTH                 equ 0001h
LCDDATA0_SEG1COM0_MASK                   equ 0002h
LCDDATA0_SEG2COM0_POSN                   equ 0002h
LCDDATA0_SEG2COM0_POSITION               equ 0002h
LCDDATA0_SEG2COM0_SIZE                   equ 0001h
LCDDATA0_SEG2COM0_LENGTH                 equ 0001h
LCDDATA0_SEG2COM0_MASK                   equ 0004h
LCDDATA0_SEG3COM0_POSN                   equ 0003h
LCDDATA0_SEG3COM0_POSITION               equ 0003h
LCDDATA0_SEG3COM0_SIZE                   equ 0001h
LCDDATA0_SEG3COM0_LENGTH                 equ 0001h
LCDDATA0_SEG3COM0_MASK                   equ 0008h
LCDDATA0_SEG4COM0_POSN                   equ 0004h
LCDDATA0_SEG4COM0_POSITION               equ 0004h
LCDDATA0_SEG4COM0_SIZE                   equ 0001h
LCDDATA0_SEG4COM0_LENGTH                 equ 0001h
LCDDATA0_SEG4COM0_MASK                   equ 0010h
LCDDATA0_SEG5COM0_POSN                   equ 0005h
LCDDATA0_SEG5COM0_POSITION               equ 0005h
LCDDATA0_SEG5COM0_SIZE                   equ 0001h
LCDDATA0_SEG5COM0_LENGTH                 equ 0001h
LCDDATA0_SEG5COM0_MASK                   equ 0020h
LCDDATA0_SEG6COM0_POSN                   equ 0006h
LCDDATA0_SEG6COM0_POSITION               equ 0006h
LCDDATA0_SEG6COM0_SIZE                   equ 0001h
LCDDATA0_SEG6COM0_LENGTH                 equ 0001h
LCDDATA0_SEG6COM0_MASK                   equ 0040h
LCDDATA0_SEG7COM0_POSN                   equ 0007h
LCDDATA0_SEG7COM0_POSITION               equ 0007h
LCDDATA0_SEG7COM0_SIZE                   equ 0001h
LCDDATA0_SEG7COM0_LENGTH                 equ 0001h
LCDDATA0_SEG7COM0_MASK                   equ 0080h
LCDDATA0_S00C0_POSN                      equ 0000h
LCDDATA0_S00C0_POSITION                  equ 0000h
LCDDATA0_S00C0_SIZE                      equ 0001h
LCDDATA0_S00C0_LENGTH                    equ 0001h
LCDDATA0_S00C0_MASK                      equ 0001h
LCDDATA0_S01C0_POSN                      equ 0001h
LCDDATA0_S01C0_POSITION                  equ 0001h
LCDDATA0_S01C0_SIZE                      equ 0001h
LCDDATA0_S01C0_LENGTH                    equ 0001h
LCDDATA0_S01C0_MASK                      equ 0002h
LCDDATA0_S02C0_POSN                      equ 0002h
LCDDATA0_S02C0_POSITION                  equ 0002h
LCDDATA0_S02C0_SIZE                      equ 0001h
LCDDATA0_S02C0_LENGTH                    equ 0001h
LCDDATA0_S02C0_MASK                      equ 0004h
LCDDATA0_S03C0_POSN                      equ 0003h
LCDDATA0_S03C0_POSITION                  equ 0003h
LCDDATA0_S03C0_SIZE                      equ 0001h
LCDDATA0_S03C0_LENGTH                    equ 0001h
LCDDATA0_S03C0_MASK                      equ 0008h
LCDDATA0_S04C0_POSN                      equ 0004h
LCDDATA0_S04C0_POSITION                  equ 0004h
LCDDATA0_S04C0_SIZE                      equ 0001h
LCDDATA0_S04C0_LENGTH                    equ 0001h
LCDDATA0_S04C0_MASK                      equ 0010h
LCDDATA0_S05C0_POSN                      equ 0005h
LCDDATA0_S05C0_POSITION                  equ 0005h
LCDDATA0_S05C0_SIZE                      equ 0001h
LCDDATA0_S05C0_LENGTH                    equ 0001h
LCDDATA0_S05C0_MASK                      equ 0020h
LCDDATA0_S06C0_POSN                      equ 0006h
LCDDATA0_S06C0_POSITION                  equ 0006h
LCDDATA0_S06C0_SIZE                      equ 0001h
LCDDATA0_S06C0_LENGTH                    equ 0001h
LCDDATA0_S06C0_MASK                      equ 0040h
LCDDATA0_S07C0_POSN                      equ 0007h
LCDDATA0_S07C0_POSITION                  equ 0007h
LCDDATA0_S07C0_SIZE                      equ 0001h
LCDDATA0_S07C0_LENGTH                    equ 0001h
LCDDATA0_S07C0_MASK                      equ 0080h

