GopalSaraf/Practicals/PSDL/include/proc/pic18f8493.inc
// Register: LCDDATA14
#define LCDDATA14 LCDDATA14
LCDDATA14                                equ 0F73h
// bitfield definitions
LCDDATA14_LCDDATA14_POSN                 equ 0000h
LCDDATA14_LCDDATA14_POSITION             equ 0000h
LCDDATA14_LCDDATA14_SIZE                 equ 0008h
LCDDATA14_LCDDATA14_LENGTH               equ 0008h
LCDDATA14_LCDDATA14_MASK                 equ 00FFh
LCDDATA14_S16C2_POSN                     equ 0000h
LCDDATA14_S16C2_POSITION                 equ 0000h
LCDDATA14_S16C2_SIZE                     equ 0001h
LCDDATA14_S16C2_LENGTH                   equ 0001h
LCDDATA14_S16C2_MASK                     equ 0001h
LCDDATA14_S17C2_POSN                     equ 0001h
LCDDATA14_S17C2_POSITION                 equ 0001h
LCDDATA14_S17C2_SIZE                     equ 0001h
LCDDATA14_S17C2_LENGTH                   equ 0001h
LCDDATA14_S17C2_MASK                     equ 0002h
LCDDATA14_S18C2_POSN                     equ 0002h
LCDDATA14_S18C2_POSITION                 equ 0002h
LCDDATA14_S18C2_SIZE                     equ 0001h
LCDDATA14_S18C2_LENGTH                   equ 0001h
LCDDATA14_S18C2_MASK                     equ 0004h
LCDDATA14_S19C2_POSN                     equ 0003h
LCDDATA14_S19C2_POSITION                 equ 0003h
LCDDATA14_S19C2_SIZE                     equ 0001h
LCDDATA14_S19C2_LENGTH                   equ 0001h
LCDDATA14_S19C2_MASK                     equ 0008h
LCDDATA14_S20C2_POSN                     equ 0004h
LCDDATA14_S20C2_POSITION                 equ 0004h
LCDDATA14_S20C2_SIZE                     equ 0001h
LCDDATA14_S20C2_LENGTH                   equ 0001h
LCDDATA14_S20C2_MASK                     equ 0010h
LCDDATA14_S21C2_POSN                     equ 0005h
LCDDATA14_S21C2_POSITION                 equ 0005h
LCDDATA14_S21C2_SIZE                     equ 0001h
LCDDATA14_S21C2_LENGTH                   equ 0001h
LCDDATA14_S21C2_MASK                     equ 0020h
LCDDATA14_S22C2_POSN                     equ 0006h
LCDDATA14_S22C2_POSITION                 equ 0006h
LCDDATA14_S22C2_SIZE                     equ 0001h
LCDDATA14_S22C2_LENGTH                   equ 0001h
LCDDATA14_S22C2_MASK                     equ 0040h
LCDDATA14_S23C2_POSN                     equ 0007h
LCDDATA14_S23C2_POSITION                 equ 0007h
LCDDATA14_S23C2_SIZE                     equ 0001h
LCDDATA14_S23C2_LENGTH                   equ 0001h
LCDDATA14_S23C2_MASK                     equ 0080h
LCDDATA14_SEG16COM2_POSN                 equ 0000h
LCDDATA14_SEG16COM2_POSITION             equ 0000h
LCDDATA14_SEG16COM2_SIZE                 equ 0001h
LCDDATA14_SEG16COM2_LENGTH               equ 0001h
LCDDATA14_SEG16COM2_MASK                 equ 0001h
LCDDATA14_SEG17COM2_POSN                 equ 0001h
LCDDATA14_SEG17COM2_POSITION             equ 0001h
LCDDATA14_SEG17COM2_SIZE                 equ 0001h
LCDDATA14_SEG17COM2_LENGTH               equ 0001h
LCDDATA14_SEG17COM2_MASK                 equ 0002h
LCDDATA14_SEG18COM2_POSN                 equ 0002h
LCDDATA14_SEG18COM2_POSITION             equ 0002h
LCDDATA14_SEG18COM2_SIZE                 equ 0001h
LCDDATA14_SEG18COM2_LENGTH               equ 0001h
LCDDATA14_SEG18COM2_MASK                 equ 0004h
LCDDATA14_SEG19COM2_POSN                 equ 0003h
LCDDATA14_SEG19COM2_POSITION             equ 0003h
LCDDATA14_SEG19COM2_SIZE                 equ 0001h
LCDDATA14_SEG19COM2_LENGTH               equ 0001h
LCDDATA14_SEG19COM2_MASK                 equ 0008h
LCDDATA14_SEG20COM2_POSN                 equ 0004h
LCDDATA14_SEG20COM2_POSITION             equ 0004h
LCDDATA14_SEG20COM2_SIZE                 equ 0001h
LCDDATA14_SEG20COM2_LENGTH               equ 0001h
LCDDATA14_SEG20COM2_MASK                 equ 0010h
LCDDATA14_SEG21COM2_POSN                 equ 0005h
LCDDATA14_SEG21COM2_POSITION             equ 0005h
LCDDATA14_SEG21COM2_SIZE                 equ 0001h
LCDDATA14_SEG21COM2_LENGTH               equ 0001h
LCDDATA14_SEG21COM2_MASK                 equ 0020h
LCDDATA14_SEG22COM2_POSN                 equ 0006h
LCDDATA14_SEG22COM2_POSITION             equ 0006h
LCDDATA14_SEG22COM2_SIZE                 equ 0001h
LCDDATA14_SEG22COM2_LENGTH               equ 0001h
LCDDATA14_SEG22COM2_MASK                 equ 0040h
LCDDATA14_SEG23COM2_POSN                 equ 0007h
LCDDATA14_SEG23COM2_POSITION             equ 0007h
LCDDATA14_SEG23COM2_SIZE                 equ 0001h
LCDDATA14_SEG23COM2_LENGTH               equ 0001h
LCDDATA14_SEG23COM2_MASK                 equ 0080h
LCDDATA14_MSK0_POSN                      equ 0000h
LCDDATA14_MSK0_POSITION                  equ 0000h
LCDDATA14_MSK0_SIZE                      equ 0001h
LCDDATA14_MSK0_LENGTH                    equ 0001h
LCDDATA14_MSK0_MASK                      equ 0001h
LCDDATA14_MSK1_POSN                      equ 0001h
LCDDATA14_MSK1_POSITION                  equ 0001h
LCDDATA14_MSK1_SIZE                      equ 0001h
LCDDATA14_MSK1_LENGTH                    equ 0001h
LCDDATA14_MSK1_MASK                      equ 0002h
LCDDATA14_MSK2_POSN                      equ 0002h
LCDDATA14_MSK2_POSITION                  equ 0002h
LCDDATA14_MSK2_SIZE                      equ 0001h
LCDDATA14_MSK2_LENGTH                    equ 0001h
LCDDATA14_MSK2_MASK                      equ 0004h
LCDDATA14_MSK3_POSN                      equ 0003h
LCDDATA14_MSK3_POSITION                  equ 0003h
LCDDATA14_MSK3_SIZE                      equ 0001h
LCDDATA14_MSK3_LENGTH                    equ 0001h
LCDDATA14_MSK3_MASK                      equ 0008h
LCDDATA14_MSK4_POSN                      equ 0004h
LCDDATA14_MSK4_POSITION                  equ 0004h
LCDDATA14_MSK4_SIZE                      equ 0001h
LCDDATA14_MSK4_LENGTH                    equ 0001h
LCDDATA14_MSK4_MASK                      equ 0010h
LCDDATA14_MSK5_POSN                      equ 0005h
LCDDATA14_MSK5_POSITION                  equ 0005h
LCDDATA14_MSK5_SIZE                      equ 0001h
LCDDATA14_MSK5_LENGTH                    equ 0001h
LCDDATA14_MSK5_MASK                      equ 0020h
LCDDATA14_MSK6_POSN                      equ 0006h
LCDDATA14_MSK6_POSITION                  equ 0006h
LCDDATA14_MSK6_SIZE                      equ 0001h
LCDDATA14_MSK6_LENGTH                    equ 0001h
LCDDATA14_MSK6_MASK                      equ 0040h
LCDDATA14_MSK7_POSN                      equ 0007h
LCDDATA14_MSK7_POSITION                  equ 0007h
LCDDATA14_MSK7_SIZE                      equ 0001h
LCDDATA14_MSK7_LENGTH                    equ 0001h
LCDDATA14_MSK7_MASK                      equ 0080h

